# GetLegacyStairOrRampComponents Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFCUtils..::..GetLegacyStairOrRampComponents Method
ExporterIFCUtils Class See Also
---
Gets the components of a stair or ramp.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static IFCLegacyStairOrRamp GetLegacyStairOrRampComponents(
	ExporterIFC exporterIFC,
	Element element
)
```

Visual Basic
---
```text
Public Shared Function GetLegacyStairOrRampComponents ( _
	exporterIFC As ExporterIFC, _
	element As Element _
) As IFCLegacyStairOrRamp
```

Visual C++
---
```text
public:
static IFCLegacyStairOrRamp^ GetLegacyStairOrRampComponents(
	ExporterIFC^ exporterIFC,
	Element^ element
)
```

# ### Parameters
exporterIFC
    Type: Autodesk.Revit.DB.IFC..::..ExporterIFC The exporter.
element
    Type: Autodesk.Revit.DB..::..Element The legacy stair or ramp element.
# ### Return Value
The LegacyStairOrRamp that contains the components. NULL means the components can't be determined.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace